## Staging: common
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 14 to add, 0 to change, 0 to destroy
```
<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # aws_cloudwatch_metric_alarm.scan-files-document-download-bucket-size-warning will be created
  + resource "aws_cloudwatch_metric_alarm" "scan-files-document-download-bucket-size-warning" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:ca-central-1:239043911459:alert-warning",
        ]
      + alarm_description                     = "Scan files document download S3 bucket size is larger than 0.5 GB"
      + alarm_name                            = "scan-files-document-download-bucket-size-warning"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanOrEqualToThreshold"
      + dimensions                            = {
          + "BucketName"  = "notification-canada-ca-staging-document-download-scan-files"
          + "StorageType" = "StandardStorage"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "BucketSizeBytes"
      + namespace                             = "AWS/S3"
      + period                                = 86400
      + statistic                             = "Average"
      + tags_all                              = (known after apply)
      + threshold                             = 536870912
      + treat_missing_data                    = "missing"
    }

  # aws_s3_bucket.scan_files_document_bucket will be created
  + resource "aws_s3_bucket" "scan_files_document_bucket" {
      + acceleration_status         = (known after apply)
      + acl                         = "private"
      + arn                         = (known after apply)
      + bucket                      = "notification-canada-ca-staging-document-download-scan-files"
      + bucket_domain_name          = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "CostCenter" = "notification-canada-ca-staging"
        }
      + tags_all                    = {
          + "CostCenter" = "notification-canada-ca-staging"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + lifecycle_rule {
          + enabled = true
          + id      = "tf-s3-lifecycle-all-files"

          + expiration {
              + days = 1
            }
        }

      + logging {
          + target_bucket = "notification-canada-ca-staging-document-download-logs"
        }

      + server_side_encryption_configuration {
          + rule {
              + apply_server_side_encryption_by_default {
                  + sse_algorithm = "AES256"
                }
            }
        }

      + versioning {
          + enabled    = (known after apply)
          + mfa_delete = (known after apply)
        }
    }

  # aws_s3_bucket_public_access_block.scan_files_document_bucket will be created
  + resource "aws_s3_bucket_public_access_block" "scan_files_document_bucket" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + restrict_public_buckets = true
    }

  # module.s3_scan_objects.data.aws_iam_policy_document.limit_tagging[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "limit_tagging"  {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "s3:DeleteObjectTagging",
              + "s3:DeleteObjectVersionTagging",
              + "s3:PutObjectTagging",
              + "s3:PutObjectVersionTagging",
            ]
          + effect    = "Deny"
          + resources = [
              + "arn:aws:s3:::notification-canada-ca-staging-document-download-scan-files/*",
            ]

          + condition {
              + test     = "StringNotLike"
              + values   = [
                  + (known after apply),
                ]
              + variable = "aws:PrincipalArn"
            }

          + principals {
              + identifiers = [
                  + "*",
                ]
              + type        = "AWS"
            }
        }
      + statement {
          + actions   = [
              + "s3:PutObjectTagging",
              + "s3:PutObjectVersionTagging",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:s3:::notification-canada-ca-staging-document-download-scan-files/*",
            ]

          + principals {
              + identifiers = [
                  + (known after apply),
                ]
              + type        = "AWS"
            }
        }
    }

  # module.s3_scan_objects.data.aws_iam_policy_document.s3_scan_object will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "s3_scan_object"  {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "logs:CreateLogStream",
              + "logs:PutLogEvents",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "lambda:InvokeFunction",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:lambda:ca-central-1:806545929748:function:s3-scan-object",
            ]
        }
    }

  # module.s3_scan_objects.data.aws_iam_policy_document.scan_files_download[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "scan_files_download"  {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "s3:GetBucketLocation",
              + "s3:GetObject",
              + "s3:GetObjectTagging",
              + "s3:GetObjectVersion",
              + "s3:GetObjectVersionTagging",
              + "s3:ListBucket",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:s3:::notification-canada-ca-staging-document-download-scan-files",
              + "arn:aws:s3:::notification-canada-ca-staging-document-download-scan-files/*",
            ]

          + principals {
              + identifiers = [
                  + (known after apply),
                ]
              + type        = "AWS"
            }
        }
    }

  # module.s3_scan_objects.data.aws_iam_policy_document.upload_bucket[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "upload_bucket"  {
      + id                      = (known after apply)
      + json                    = (known after apply)
      + source_policy_documents = [
          + (known after apply),
          + (known after apply),
        ]
    }

  # module.s3_scan_objects.aws_cloudwatch_log_group.s3_scan_object will be created
  + resource "aws_cloudwatch_log_group" "s3_scan_object" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/aws/lambda/s3-scan-object-gc-notify"
      + retention_in_days = 7
      + tags              = {
          + "CostCentre" = "notification-canada-ca-staging"
          + "Terraform"  = "true"
        }
      + tags_all          = {
          + "CostCentre" = "notification-canada-ca-staging"
          + "Terraform"  = "true"
        }
    }

  # module.s3_scan_objects.aws_iam_policy.s3_scan_object will be created
  + resource "aws_iam_policy" "s3_scan_object" {
      + arn       = (known after apply)
      + id        = (known after apply)
      + name      = "S3ScanObject-gc-notify"
      + path      = "/"
      + policy    = (known after apply)
      + policy_id = (known after apply)
      + tags_all  = (known after apply)
    }

  # module.s3_scan_objects.aws_iam_policy.scan_files[0] will be created
  + resource "aws_iam_policy" "scan_files" {
      + arn       = (known after apply)
      + id        = (known after apply)
      + name      = "ScanFilesGetObjects"
      + path      = "/"
      + policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "s3:PutObjectVersionTagging",
                          + "s3:PutObjectTagging",
                          + "s3:ListBucket",
                          + "s3:GetObjectVersionTagging",
                          + "s3:GetObjectVersion",
                          + "s3:GetObjectTagging",
                          + "s3:GetObject",
                          + "s3:GetBucketLocation",
                          + "s3:DeleteObjectVersionTagging",
                          + "s3:DeleteObjectTagging",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:s3:::notification-canada-ca-staging-document-download-scan-files/*",
                          + "arn:aws:s3:::notification-canada-ca-staging-document-download-scan-files",
                        ]
                      + Sid      = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id = (known after apply)
      + tags      = {
          + "CostCentre" = "notification-canada-ca-staging"
          + "Terraform"  = "true"
        }
      + tags_all  = {
          + "CostCentre" = "notification-canada-ca-staging"
          + "Terraform"  = "true"
        }
    }

  # module.s3_scan_objects.aws_iam_role.s3_scan_object will be created
  + resource "aws_iam_role" "s3_scan_object" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "S3ScanObject-gc-notify"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.s3_scan_objects.aws_iam_role.scan_files[0] will be created
  + resource "aws_iam_role" "scan_files" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = [
                              + "arn:aws:iam::806545929748:role/s3-scan-object",
                              + "arn:aws:iam::806545929748:role/scan-files-api",
                            ]
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "ScanFilesGetObjects"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "CostCentre" = "notification-canada-ca-staging"
          + "Terraform"  = "true"
        }
      + tags_all              = {
          + "CostCentre" = "notification-canada-ca-staging"
          + "Terraform"  = "true"
        }
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.s3_scan_objects.aws_iam_role_policy_attachment.s3_scan_object will be created
  + resource "aws_iam_role_policy_attachment" "s3_scan_object" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "S3ScanObject-gc-notify"
    }

  # module.s3_scan_objects.aws_iam_role_policy_attachment.scan_files[0] will be created
  + resource "aws_iam_role_policy_attachment" "scan_files" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "ScanFilesGetObjects"
    }

  # module.s3_scan_objects.aws_lambda_function.s3_scan_object will be created
  + resource "aws_lambda_function" "s3_scan_object" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + filename                       = "/tmp/main.py.zip"
      + function_name                  = "s3-scan-object-gc-notify"
      + handler                        = "main.handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 512
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + reserved_concurrent_executions = 10
      + role                           = (known after apply)
      + runtime                        = "python3.8"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + source_code_hash               = "DHJ3p3lp/iUsdHa+AW0S5K/vLOTVNPr6e/deRtYmSFY="
      + source_code_size               = (known after apply)
      + tags                           = {
          + "CostCentre" = "notification-canada-ca-staging"
          + "Terraform"  = "true"
        }
      + tags_all                       = {
          + "CostCentre" = "notification-canada-ca-staging"
          + "Terraform"  = "true"
        }
      + timeout                        = 3
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "ACCOUNT_ID"                  = "239043911459"
              + "S3_SCAN_OBJECT_FUNCTION_ARN" = "arn:aws:lambda:ca-central-1:806545929748:function:s3-scan-object"
            }
        }

      + tracing_config {
          + mode = "PassThrough"
        }
    }

  # module.s3_scan_objects.aws_lambda_permission.s3_execute will be created
  + resource "aws_lambda_permission" "s3_execute" {
      + action        = "lambda:InvokeFunction"
      + function_name = "s3-scan-object-gc-notify"
      + id            = (known after apply)
      + principal     = "s3.amazonaws.com"
      + source_arn    = "arn:aws:s3:::notification-canada-ca-staging-document-download-scan-files"
      + statement_id  = "S3ScanObjectS3Invoke-gc-notify"
    }

  # module.s3_scan_objects.aws_s3_bucket_notification.s3_scan_object will be created
  + resource "aws_s3_bucket_notification" "s3_scan_object" {
      + bucket      = "notification-canada-ca-staging-document-download-scan-files"
      + eventbridge = false
      + id          = (known after apply)

      + lambda_function {
          + events              = [
              + "s3:ObjectCreated:*",
            ]
          + id                  = "ScanObjectCreated"
          + lambda_function_arn = (known after apply)
        }
    }

  # module.s3_scan_objects.aws_s3_bucket_policy.upload_bucket[0] will be created
  + resource "aws_s3_bucket_policy" "upload_bucket" {
      + bucket = "notification-canada-ca-staging-document-download-scan-files"
      + id     = (known after apply)
      + policy = (known after apply)
    }

Plan: 14 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"
Releasing state lock. This may take a few moments...

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_athena_workgroup.primary"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_event_rule.aws_health"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.route53_resolver_query_log"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.ses_receiving_emails"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.sns_deliveries"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.sns_deliveries_failures"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.sns_deliveries_failures_us_west_2"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.sns_deliveries_us_west_2"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.bulk-bulk-not-being-processed-critical"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.bulk-bulk-not-being-processed-warning"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.bulk-inflights-not-being-processed-critical"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.bulk-inflights-not-being-processed-warning"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.bulk-not-being-processed-critical"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.bulk-not-being-processed-warning"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.contact-3-500-error-15-minutes-critical"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.document-download-bucket-size-warning"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.expired-email-created-critical"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.expired-email-created-warning"]
WARN - plan.json - main - Missing Common Tags:...
```

</details>
